# pandas

In [2]:
import pandas as pd
import numpy as np

In [3]:
array = [10,20,40,50,60]
series = pd.Series(array)
print(series)

0    10
1    20
2    40
3    50
4    60
dtype: int64

In [4]:
custom_series = pd.Series(array,index = ['a','b','c',10,20])
print(custom_series)

a     10
b     20
c     40
10    50
20    60
dtype: int64

In [5]:
data = {
    'name':['vaibhavi','vaishnavi','advaith','arnav'],
    'dept':['CS','IT','CE','CE'],
    'marks':[97,89,30,80],
    'passed':[True,True,False,True],
}
data_framed = pd.DataFrame(data)
print(data_framed)

        name dept  marks  passed
0   vaibhavi   CS     97    True
1  vaishnavi   IT     89    True
2    advaith   CE     30   False
3      arnav   CE     80    True

In [6]:
data_framed.head(3) # by default 5 values are display

        name dept  marks  passed
0   vaibhavi   CS     97    True
1  vaishnavi   IT     89    True
2    advaith   CE     30   False

In [7]:
data_framed.tail(2)

      name dept  marks  passed
2  advaith   CE     30   False
3    arnav   CE     80    True

# filtering the data

In [8]:
high_score = data_framed[data_framed['marks']>80]
print(high_score)

        name dept  marks  passed
0   vaibhavi   CS     97    True
1  vaishnavi   IT     89    True

In [9]:
passed_check = data_framed[data_framed['passed'] == True]
print(passed_check)

        name dept  marks  passed
0   vaibhavi   CS     97    True
1  vaishnavi   IT     89    True
3      arnav   CE     80    True

In [10]:
dept_check = data_framed[data_framed['dept'] == 'CE']
print(dept_check)

      name dept  marks  passed
2  advaith   CE     30   False
3    arnav   CE     80    True

# grouping

In [11]:
mean_marks = data_framed.groupby('dept')['marks'].mean()
print(mean_marks)

dept
CE    55.0
CS    97.0
IT    89.0
Name: marks, dtype: float64

In [12]:
count_name = data_framed.groupby('dept')['name'].count()
print(count_name)

dept
CE    2
CS    1
IT    1
Name: name, dtype: int64

## add new col based on condition

In [14]:
data_framed["grades"]=["A" if mark >=85 else "B" for mark in data_framed["marks"]]
print(data_framed)

        name dept  marks  passed grades
0   vaibhavi   CS     97    True      A
1  vaishnavi   IT     89    True      A
2    advaith   CE     30   False      B
3      arnav   CE     80    True      B

In [15]:
data_framed.to_csv("student_details.csv",index = False) #import data

In [19]:
loaded_lap = pd.read_csv("laptop_data.csv")
print(loaded_lap) # export data

     Brand Processor  RAM (GB)  Price (INR)
0     Acer   Ryzen 5        32        66302
1    Apple   Ryzen 7         4       120239
2       HP        i9         4        76728
3    Apple   Ryzen 7         8        56251
4     Asus        i5        16        39692
..     ...       ...       ...          ...
95    Acer        i9        16       143835
96  Lenovo        i7         4        50528
97     MSI   Ryzen 5         8       127506
98   Apple        i9         8        34770
99    Asus   Ryzen 5        16        79763

[100 rows x 4 columns]

In [20]:
loaded_lap.sort_values(by = "Price (INR)",inplace = True)
print(loaded_lap) # sort price in the col

     Brand Processor  RAM (GB)  Price (INR)
11     MSI        i9        16        30956
48     MSI        i5        16        31877
54     MSI        i3        16        33286
47    Acer   Ryzen 5         8        34432
98   Apple        i9         8        34770
..     ...       ...       ...          ...
62   Apple   Ryzen 5        32       146557
94  Lenovo   Ryzen 3         4       147457
10    Acer        i3         8       148776
28  Lenovo        i3         4       149688
16     MSI        i7        32       149938

[100 rows x 4 columns]

In [21]:
loaded_lap.drop("Processor",axis=1) # col axis = 1 row axis = 0

     Brand  RAM (GB)  Price (INR)
11     MSI        16        30956
48     MSI        16        31877
54     MSI        16        33286
47    Acer         8        34432
98   Apple         8        34770
..     ...       ...          ...
62   Apple        32       146557
94  Lenovo         4       147457
10    Acer         8       148776
28  Lenovo         4       149688
16     MSI        32       149938

[100 rows x 3 columns]

In [22]:
marks  = [35,50,40,80,90,70,65,78,61,38]
mean = np.mean(marks)
print(mean)

60.7

In [23]:
median = np.median(marks)
print(median)

63.0

In [31]:
loaded_lap.sort_values(by = "Price (INR)", inplace = True, ascending = False)
print(loaded_lap)

     Brand Processor  RAM (GB)  Price (INR)
16     MSI        i7        32       149938
28  Lenovo        i3         4       149688
10    Acer        i3         8       148776
94  Lenovo   Ryzen 3         4       147457
62   Apple   Ryzen 5        32       146557
..     ...       ...       ...          ...
98   Apple        i9         8        34770
47    Acer   Ryzen 5         8        34432
54     MSI        i3        16        33286
48     MSI        i5        16        31877
11     MSI        i9        16        30956

[100 rows x 4 columns]